package com.company.lab9;
import java.util.Scanner;
public class Task13 {
    public static void main(String[] args) {
        Scanner In = new Scanner(System.in);

        /**
         * Сделать два массива с буквами и цифрами
         * Переделать массив с буквами в массив с индексами
         * Создать цикл в котором мы присваевам 1 в элементы по X Y, где Y это цифры а X индексы букв
         * Пройтись по строкам массива и заменить 0 на пробел а 1 на #
         */
        System.out.print("Введите координаты :");
    }
}
